# CADLinkOptions Constructor (CADLinkOptions)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CADLinkOptions Constructor (CADLinkOptions)
CADLinkOptions Class See Also
---
Constructs a new copy of the input CADLinkOptions object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public CADLinkOptions(
	CADLinkOptions other
)
```

Visual Basic
---
```text
Public Sub New ( _
	other As CADLinkOptions _
)
```

Visual C++
---
```text
public:
CADLinkOptions(
	CADLinkOptions^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB..::..CADLinkOptions
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
CADLinkOptions Class
CADLinkOptions Overload
Autodesk.Revit.DB Namespace